const articlesStorage = [
  {
    id: 'rossiya-snimet-zapret-na-import-moldavskih-vin',
    title: 'Россия снимет запрет на импорт молдавских вин',
    author: 'sports',
    createdAt: new Date('2017-02-28T05:24:23.856Z'),
    content: `<div class="Body">
             <p>Запрет на&nbsp;импорт молдавских вин в&nbsp;Россию, действующий с&nbsp;сентября 2013 года, в&nbsp;ближайшее время будет снят еще с&nbsp;нескольких предприятий. Об&nbsp;этом объявила глава Роспотребнадзора Анна Попова по&nbsp;итогам проверки российским специалистами молдавских винодельческих предприятий.</p>
<p>Эксперты Роспотребнадзора, сообщила Попова, проверили 13 молдавских предприятий. Большинство из&nbsp;них, по&nbsp;словам главы Роспотребнадзора, смогут поставлять свою продукцию на&nbsp;российский рынок.</p>
<p>С&nbsp;2015 года поставки вин на&nbsp;российский рынок <a href="http://tass.ru/ekonomika/2171763" target="_blank">были разрешены</a> нескольким молдавским предприятиям, однако целиком запрет пока не&nbsp;снят.</p>
           </div>`,
    summary:
      'Запрет на импорт молдавских вин в Россию, действующий с сентября 2013 года, в ближайшее время будет снят еще с нескольких предприятий. '
  },
  {
    id:
      'tramp-obvinil-obamu-v-organizatsii-protestov-po-vsey-strane-i-utechek-v-smi',
    title:
      'Трамп обвинил Обаму в организации протестов по всей стране и утечек в СМИ',
    author: 'sports',
    createdAt: new Date('2017-02-27T05:24:23.316Z'),
    content: `<div class="Body">
             <p>Президент США Дональд Трамп обвинил своего предшественника Барака Обаму в&nbsp;организации протестов против республиканцев по&nbsp;всей стране. Об&nbsp;этом Трамп заявил в&nbsp;беседе с&nbsp;ведущими Fox News.</p>
<p>Трамп согласился с&nbsp;предположением одного из&nbsp;собеседников, что протесты во&nbsp;время выступлений конгрессменов-республиканцев организованы при участии «Организации к&nbsp;действию»&nbsp;— НКО, ставшей преемницей предвыборного штаба Обамы.</p>                
<p>«Думаю, что за&nbsp;этим стоит президент Обама, потому что там точно его люди. От&nbsp;этой группы также исходят некоторые утечки [в СМИ]»,&nbsp;— ответил Трамп на&nbsp;это утверждение.</p>
<p>Никаких конкретных свидетельств участия Обамы в&nbsp;этих акциях Трамп не&nbsp;привел. Представитель Обамы пока никак не&nbsp;прокомментировал эти обвинения.</p>
<p>Как <a href="http://www.politifact.com/truth-o-meter/statements/2017/feb/27/louie-gohmert/protesters-are-paid-disrupt-town-hall-meetings-goh/" target="_blank">отмечает</a> <span data-title="Politifact" class="FootnoteLink" data-body="&amp;lt;p&amp;gt;Сайт, посвященный фактчекингу (проверке правдивости утверждений), который создали журналисты Tampa Bay Times. В 2009 году коллектив сайта получил Пулитцеровскую премию за работу в ходе президентской кампании.&amp;lt;/p&amp;gt;">Politifact</span>, республиканцы и&nbsp;раньше утверждали, что протесты последнего времени организованы и&nbsp;оплачены. При этом никаких доказательств такой организации представлено не&nbsp;было.</p>
           </div>`,
    summary:
      'Президент США Дональд Трамп обвинил своего предшественника Барака Обаму в организации протестов против республиканцев по всей стране.'
  },
  {
    id: 'rosneft-zainteresovalas-dobychey-v-meksikanskom-zalive',
    title: '«Роснефть» заинтересовалась добычей в Мексиканском заливе',
    author: 'meduza',
    createdAt: new Date('2017-02-26T05:24:22.818Z'),
    content: `<div class="Body">
             <p>«Роснефть» рассматривает возможность добычи на&nbsp;мелководных участках в&nbsp;Мексиканском заливе, сообщили источники «Коммерсанта».</p>
<p>Компания, по&nbsp;их&nbsp;словам, изучает участки, которые будут выставлены на&nbsp;торги летом 2017 года. Речь идет о&nbsp;15 контрактах «на&nbsp;условиях соглашения о&nbsp;разделе продукции».</p>
<p>Из-за санкций, отметили собеседники издания, «Роснефть» не&nbsp;может бороться за&nbsp;право ведения добычи на&nbsp;глубоководном шельфе, а&nbsp;сухопутные участки ее&nbsp;не&nbsp;интересуют.</p>
<p>«Роснефть», как отметили опрошенные газетой эксперты, стремится расширить свою деятельность в&nbsp;Америке, в&nbsp;том числе из-за уже имеющихся у&nbsp;нее проектов в&nbsp;Венесуэле, на&nbsp;Кубе, в&nbsp;Бразилии.</p>
<p>В&nbsp;«Роснефти» комментировать сообщения об&nbsp;интересе компании к&nbsp;участкам на&nbsp;шельфе Мексики отказались.</p>
           </div>`,
    summary:
      '«Роснефть» рассматривает возможность добычи на мелководных участках в Мексиканском заливе, сообщили источники «Коммерсанта».'
  },
  {
    id:
      'amerikanskiy-senator-predlozhil-nazvat-imenem-nemtsova-ulitsu-pered-posolstvom-rossii',
    title:
      'Американский сенатор предложил назвать именем Немцова улицу перед посольством России',
    author: 'meduza',
    createdAt: new Date('2017-02-25T05:24:21.043Z'),
    content: `<div class="Body">
             <p>Сенатор-республиканец от&nbsp;Флориды Марко Рубио подготовил законопроект о&nbsp;переименовании улицы перед российским посольством в&nbsp;Вашингтоне в&nbsp;«Борис Немцов плаза».</p>
<p>Документ предлагает переименовать участок Висконсин авеню напротив посольства. При этом адрес посольства предлагается изменить с&nbsp;«2650 Висконсин авеню» на&nbsp;«1 Борис Немцов плаза».</p>
<p>27&nbsp;февраля, в&nbsp;день второй годовщины убийства Немцова, Рубио принял участие в&nbsp;памятных мероприятиях у&nbsp;российского посольства.</p>
           </div>`,
    summary:
      'Сенатор-республиканец от Флориды Марко Рубио подготовил законопроект о переименовании улицы перед российским посольством в Вашингтоне в «Борис Немцов плаза».'
  },
  {
    id: 'rossiya-otkazalas-zaderzhat-podozrevaemyh-v-ubiystve-kim-chen-nama',
    title: 'Россия отказалась задержать подозреваемых в убийстве Ким Чен Нама',
    author: 'meduza',
    createdAt: new Date('2017-02-24T05:24:19.591Z'),
    content: `<div class="Body">
             <p>Российские правоохранительные органы отказались задерживать подозреваемых в&nbsp;причастности к&nbsp;убийству Ким Чен Нама по&nbsp;запросу Южной Кореи. Об&nbsp;этом со&nbsp;ссылкой на&nbsp;неназванный дипломатический источник пишет «Чунан ильбо».</p>
<p>Как отмечает издание, после убийства четыре гражданина КНДР покинули Малайзию и&nbsp;направились в&nbsp;Пхеньян через Джакарту, Дубай, Москву и&nbsp;Владивосток. Южная Корея направила России запрос на&nbsp;задержание подозреваемых, но&nbsp;в&nbsp;Москве не&nbsp;нашли для этого достаточных оснований.</p>
<blockquote>
<strong>Обновление.</strong> Россия пока официально не&nbsp;прокомментировала публикацию, но&nbsp;источник в&nbsp;МИДе <a href="https://ria.ru/world/20170228/1488929597.html" target="_blank">рассказал</a> РИА Новости, что запросов от&nbsp;Малайзии по&nbsp;этому делу не&nbsp;поступало. О&nbsp;запросе из&nbsp;Сеула источник ничего не&nbsp;сказал.</blockquote>
           </div>`,
    summary:
      'Российские правоохранительные органы отказались задерживать подозреваемых в причастности к убийству Ким Чен Нама по запросу Южной Кореи.'
  },
  {
    id: 'spacex-anonsiroval-polet-kosmicheskih-turistov-k-lune-v-2018-godu',
    title: 'SpaceX пообещала отправить космических туристов к Луне в 2018 году',
    author: 'meduza',
    createdAt: new Date('2017-02-22T05:23:51.252Z'),
    content: `<div class="Body">
             <p>Компания SpaceX намерена в&nbsp;конце 2018 года отправить в&nbsp;недельный полет вокруг Луны двоих космических туристов. Об&nbsp;этом сообщил основатель компании Илон Маск.</p>
<p>Посадка на&nbsp;поверхность Луны в&nbsp;рамках экспедиции не&nbsp;предусмотрена.&nbsp;</p>
<p>Полет будет совершен на&nbsp;корабле Dragon 2 (Crew Dragon) с&nbsp;помощью тяжелой ракеты-носителя Falcon Heavy. Первые полеты как Dragon 2, так и&nbsp;Falcon Heavy запланированы на&nbsp;2017 год.</p>
<p>Имена туристов, обратившихся к&nbsp;SpaceX с&nbsp;просьбой организовать полет к&nbsp;Луне, пока не&nbsp;раскрываются. В&nbsp;компании <a href="http://www.spacex.com/news/2017/02/27/spacex-send-privately-crewed-dragon-spacecraft-beyond-moon-next-year" target="_blank">заявили</a>, что они уже внесли значительную часть платы за&nbsp;полет. Медицинские тесты и&nbsp;тренировки планируется начать в&nbsp;этом году.</p>
           </div>`,
    summary:
      'Компания SpaceX намерена в конце 2018 года отправить в недельный полет вокруг Луны двоих космических туристов. Об этом сообщил основатель компании Илон Маск.'
  },
  {
    id:
      'v-avstrii-vyhodtsa-iz-chechni-prigovorili-k-2-5-godam-tyurmy-za-uchastie-v-boyah-na-storone-ig',
    title:
      'В Австрии выходца из Чечни приговорили к 2,5 годам тюрьмы за участие в боях на стороне ИГ',
    author: 'ria',
    createdAt: new Date('2017-02-21T05:23:47.871Z'),
    content: `<div class="Body">
             <p>В&nbsp;австрийском городе Фельдкирхе суд приговорил 25-летнего выходца из&nbsp;Чечни к&nbsp;30 месяцам тюрьмы за&nbsp;участие в&nbsp;боевых действиях на&nbsp;территории Сирии на&nbsp;стороне террористической организации «Исламское государство».&nbsp;</p>
<p>Его также признали виновным в&nbsp;прохождении военной подготовки «с&nbsp;террористическими целями», пишет Associated Press.&nbsp;</p>
<p>Имя мужчины не&nbsp;называется. Из&nbsp;сообщения следует, что у&nbsp;него в&nbsp;Австрии статус беженца.</p>
<p>Подсудимый признал, что сражался в&nbsp;Сирии против правительственных войск, однако заявил, что воевал на&nbsp;стороне повстанцев из&nbsp;Свободной сирийской армии, а&nbsp;не&nbsp;ИГ. По&nbsp;его словам, им&nbsp;двигали не&nbsp;религиозные мотивы, а&nbsp;желание сместить президента Сирии Башара Асада.</p>
           </div>`,
    summary:
      'В австрийском городе Фельдкирхе суд приговорил 25-летнего выходца из Чечни к 30 месяцам тюрьмы за участие в боевых действиях на территории Сирии на стороне террористической организации «Исламское государство». '
  },
  {
    id:
      'v-peterburge-zaderzhali-uchastnika-aktsii-lgbt-spetsnaza-proshedshey-23-fevralya',
    title:
      'В Петербурге задержали участника акции «ЛГБТ-спецназа», прошедшей 23 февраля',
    author: 'ria',
    createdAt: new Date('2017-01-18T05:23:45.059Z'),
    content: `<div class="Body">
             <blockquote>
<strong>Обновление</strong>: На&nbsp;Воскресенского был составлен протокол по&nbsp;части 5 статьи 20.2 КоАП (нарушение участником публичного мероприятия порядка его проведения). После этого, <a href="https://zona.media/news/2017/27/02/otpustili-s-protokolom" target="_blank">сообщает «Медиазона»</a>, активиста отпустили из&nbsp;отделения полиции.</blockquote>
<p>В&nbsp;Санкт-Петербурге полиция задержала активиста Петра Воскресенского, принявшего 23&nbsp;февраля участие в&nbsp;акции на&nbsp;Большой Морской улице, которая заключалась в&nbsp;шуточном «смотре ЛГБТ-спецназа имени [председателя городского заксобрания Вячеслава] Макарова».</p>
<p>Воскресенского доставили в&nbsp;полицию из&nbsp;его квартиры. На&nbsp;него составили протокол по&nbsp;статье «нарушение порядка проведения публичных мероприятий» (статья 20.2 КоАП).</p>
<p>По&nbsp;информации «Медиазоны», полицейские приходили домой и&nbsp;к&nbsp;троим другим активистам; «ОВД-Инфо» <a href="https://ovdinfo.org/express-news/2017/02/27/aktivista-v-peterburge-zabrali-iz-doma-v-policiyu-v-svyazi-s-akciey-lgbt" target="_blank">пишет</a> о&nbsp;визите полицейских к&nbsp;еще одному участнику акции.</p>
           </div>`,
    summary:
      'В Санкт-Петербурге полиция задержала активиста Петра Воскресенского, принявшего 23 февраля участие в акции на Большой Морской улице, которая заключалась в шуточном «смотре ЛГБТ-спецназа имени [председателя городского заксобрания Вячеслава] Макарова».'
  },
  {
    id:
      'news/2017/02/27/nikolay-karachentsov-gospitalizirovan-posle-dtp-v-podmoskovie',
    title: 'Николай Караченцов госпитализирован после ДТП в Подмосковье',
    author: 'meduza',
    createdAt: new Date('2017-01-16T05:23:41.378Z'),
    content: `<div class="Body">
             <p>Актер Николай Караченцов госпитализирован с&nbsp;черепно-мозговой травмой после того, как машина, в&nbsp;которой он&nbsp;ехал, столкнулась с&nbsp;«Газелью» в&nbsp;Подмосковье.&nbsp;</p>
<p>У&nbsp;актера диагностировано сотрясение мозга, заявил «Интерфаксу» источник в&nbsp;экстренных службах. </p>
<p>Также были госпитализированы родственница актера и&nbsp;сопровождавшая его медсестра, сообщил источник «Интерфакса» в&nbsp;правоохранительных органах. Информации об&nbsp;их&nbsp;состоянии нет.</p>
<p>Сын актера Андрей Караченцов подтвердил факт госпитализации, добавив, что «пока никаких других деталей нет».</p>
<p>По&nbsp;словам Андрея Караченцова, в&nbsp;результате столкновения машина перевернулась, <a href="http://360tv.ru/news/syn-karachencova-podtverdil-avariyu-s-akterom-95346/" target="_blank">передает</a> телеканал «360». За&nbsp;рулем машины, как следует из&nbsp;<a href="https://life.ru/t/%D0%BD%D0%BE%D0%B2%D0%BE%D1%81%D1%82%D0%B8/979103/zhienu_karachientsova_poslie_dtp_v_podmoskovie_doprashivaiut_politsieiskiie" target="_blank">сообщения</a> «Лайфа», находилась жена актера Людмила Поргина.</p>
           </div>`,
    summary:
      'Актер Николай Караченцов госпитализирован с черепно-мозговой травмой после того, как машина, в которой он ехал, столкнулась с «Газелью» в Подмосковье. '
  },
  {
    id:
      'id-kommersant-nachnet-vypuskat-pod-nazvaniem-dengi-reklamnoe-prilozhenie',
    title:
      'ИД «Коммерсант» начнет выпускать под названием «Деньги» рекламное приложение',
    author: 'ria',
    createdAt: new Date('2017-01-15T05:23:36.803Z'),
    content: `<div class="Body">
             <p>Издательский дом «Коммерсант» начнет выпуск ежемесячного рекламного приложения под названием «Деньги», в&nbsp;котором будут выходить «тексты на&nbsp;финансовые темы». Об&nbsp;этом сообщает газета «Ведомости».</p>
<p>По&nbsp;мнению гендиректора ИД&nbsp;Владимира Желонкина, читатели не&nbsp;будут путать это издание с&nbsp;одноименным журналом, печатная версия которого была закрыта в&nbsp;январе 2017 года. При этом Желонкин «не&nbsp;исключил, что в&nbsp;будущем отдельное интернет-издание и&nbsp;рубрика „Деньги“ будут убраны с&nbsp;сайта», пишут «Ведомости».</p>
           </div>`,
    summary:
      'Издательский дом «Коммерсант» начнет выпуск ежемесячного рекламного приложения под названием «Деньги», в котором будут выходить «тексты на финансовые темы». Об этом сообщает газета «Ведомости».'
  }
];

function filterArticles(articles, filterConfig) {
  if (filterConfig && filterConfig.author && filterConfig.author !== 'all') {
    return articles.filter(function(article) {
      return filterConfig.author === article.author;
    });
  } else {
    return articles;
  }
}

export function getArticles(skip = 0, top = 3, filterConfig = {}) {  
  return filterArticles(articlesStorage, filterConfig).slice(skip, skip + top);
}

export function getArticlesCount(filterConfig) {
  return filterArticles(articlesStorage, filterConfig).length;
}

export function getArticleById(id) {
  return articlesStorage.find(article => article.id === id);
}

export function getAuthors() {
  const authorsSet = new Set(articlesStorage.map(article => article.author));
  return Array.from(authorsSet);
}
